INSERT INTO driver (first_name, last_name, license_number)
VALUES
    ('John', 'Doe', 'ABC12345'),
    ('Jane', 'Smith', 'XYZ67890'),
    ('Emily', 'Johnson', 'LMN24680'),
    ('Michael', 'Brown', 'PQR13579'),
    ('Sarah', 'Davis', 'JKL54321');

INSERT INTO vehicle (vehicle_type, vehicle_number, capacity)
VALUES
    ('Bus', 'BUS1234', 50),
    ('Minibus', 'MBUS5678', 20),
    ('Bus', 'COACH2468', 60),
    ('Bus', 'SBUS1357', 40),
    ('Tour Bus', 'TBUS9876', 55);

-- Добавление маршрутов
INSERT INTO route (start_location, end_location, description)
VALUES
    ('Москва', 'Санкт-Петербург', 'Экспресс-маршрут между Москвой и Санкт-Петербургом'),
    ('Новосибирск', 'Екатеринбург', 'Маршрут через Сибирь с красивыми видами'),
    ('Казань', 'Челябинск', 'Быстрый маршрут с минимальными остановками'),
    ('Сочи', 'Краснодар', 'Туристический маршрут с популярными достопримечательностями'),
    ('Владивосток', 'Хабаровск', 'Короткий маршрут для коммутирующих пассажиров');

-- Добавление рейсов
INSERT INTO trip (trip_number, departure_location, destination_location, departure_datetime, arrival_datetime, vehicle_id, route_id, occupied_seats)
VALUES
    ('Рейс 001', 'Москва', 'Санкт-Петербург', '2024-12-05 08:00:00', '2024-12-05 12:00:00', 1, 1, 1),
    ('Рейс 002', 'Новосибирск', 'Екатеринбург', '2024-12-06 07:30:00', '2024-12-06 13:00:00', 2, 2, 1),
    ('Рейс 003', 'Казань', 'Челябинск', '2024-12-07 09:00:00', '2024-12-07 12:30:00', 3, 3, 1),
    ('Рейс 004', 'Сочи', 'Краснодар', '2024-12-08 10:00:00', '2024-12-08 14:30:00', 4, 4, 1),
    ('Рейс 005', 'Владивосток', 'Хабаровск', '2024-12-09 06:00:00', '2024-12-09 09:00:00', 5, 5, 1);